# CLI tools
brew "antidote"
brew "bat"
brew "btop"
brew "curl"
brew "git-delta"
brew "doggo"
brew "duf"
brew "dust"
brew "fd"
brew "gh"
brew "git"
brew "gping"
brew "helm"
brew "httpie"
brew "jq"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "lsd"
brew "neovim"
brew "node"
brew "podman"
brew "procs"
brew "ripgrep"
brew "rsync"
brew "tree-sitter-cli"
brew "uv"
brew "screen"
brew "tmux"
brew "watch"
brew "wget"
brew "zoxide"

# GNU tools
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "grep"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# 1Password
cask "1password"
cask "1password-cli"

# Apps
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "firefox"
cask "google-chrome"
cask "jordanbaird-ice"
cask "iina"
cask "iterm2"
cask "obsidian"
cask "podman-desktop"
cask "visual-studio-code"
cask "vlc"

# VS Code extensions
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "Gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
